Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.4.57/samg54/svd/ATSAMG54G19.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SUPC</name>
         <version>11228E</version>
         <description>Supply Controller</description>
         <groupName>SUPC</groupName>
         <prependToName>SUPC_</prependToName>
         <baseAddress>0x400E1410</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SUPC</name>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Supply Controller Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>This bit must always be written to 0.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALSEL</name>
                     <description>Crystal Oscillator Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>XTALSELSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_SEL</name>
                           <description>If KEY is correct, switches the slow clock on the crystal oscillator output.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMMR</name>
               <description>Supply Controller Supply Monitor Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMTH</name>
                     <description>Supply Monitor Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SMTHSelect</name>
                        <enumeratedValue>
                           <name>V1P6</name>
                           <description>1.6 V</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V1P72</name>
                           <description>1.72 V</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V1P84</name>
                           <description>1.84 V</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V1P96</name>
                           <description>1.96 V</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P08</name>
                           <description>2.08 V</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P2</name>
                           <description>2.2 V</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P32</name>
                           <description>2.32 V</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P44</name>
                           <description>2.44 V</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P56</name>
                           <description>2.56 V</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P68</name>
                           <description>2.68 V</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P8</name>
                           <description>2.8 V</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V2P92</name>
                           <description>2.92 V</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V3P04</name>
                           <description>3.04 V</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V3P16</name>
                           <description>3.16 V</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V3P28</name>
                           <description>3.28 V</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>V3P4</name>
                           <description>3.4 V</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMSMPL</name>
                     <description>Supply Monitor Sampling Period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SMSMPLSelect</name>
                        <enumeratedValue>
                           <name>SMD</name>
                           <description>Supply Monitor disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CSM</name>
                           <description>Continuous Supply Monitor</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32SLCK</name>
                           <description>Supply Monitor enables one SLCK period every 32 SLCK periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256SLCK</name>
                           <description>Supply Monitor enables one SLCK period every 256 SLCK periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048SLCK</name>
                           <description>Supply Monitor enables one SLCK period every 2,048 SLCK periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMRSTEN</name>
                     <description>Supply Monitor Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMRSTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core reset signal vddcore_nreset is asserted when a supply monitor detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMIEN</name>
                     <description>Supply Monitor Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMIENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The SUPC interrupt signal is not affected when a supply monitor detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The SUPC interrupt signal is asserted when a supply monitor detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Supply Controller Mode Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VDDSEL</name>
                     <description>VRVDD Field Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VDDSELSelect</name>
                        <enumeratedValue>
                           <name>FACTORY</name>
                           <description>The voltage regulator output value is the factory-programmed value.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_VRVDD</name>
                           <description>The voltage regulator output value is defined by the value programmed in the field VRVDD.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VRVDD</name>
                     <description>VRVDD Field Selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>VRVDDSelect</name>
                        <enumeratedValue>
                           <name>FACTORY</name>
                           <description>The voltage regulator output value is the factory-programmed value.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_VRVDD</name>
                           <description>The voltage regulator output value is defined by the value programmed in the field VRVDD.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BODRSTEN</name>
                     <description>POR Core Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BODRSTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The core reset signal vddcore_nreset is not affected when a brownout detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core reset signal vddcore_nreset is asserted when a brownout detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BODDIS</name>
                     <description>POR Core Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BODDISSelect</name>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core brownout detector is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The core brownout detector is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSCBYPASS</name>
                     <description>Oscillator Bypass</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OSCBYPASSSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect. Clock selection depends on XTALSEL value.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPASS</name>
                           <description>The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSWITCH1</name>
                     <description>SRAM1 Power Switch</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PSWITCH1Select</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>The SRAM1 is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>The SRAM1 is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSWITCH2</name>
                     <description>SRAM2 Power Switch</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PSWITCH2Select</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>The SRAM2 is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>The SRAM2 is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
